IDS_ALU_MSG_FOLLOW_MEMB_NOT_DESIGN            = "Following members cannot be designed.\n\n"
IDS_ALU_MSG_FOLLOW_MEMB_NOT_CHECK             = "Following members cannot be checked.\n\n"

IDS_ALU_MSG_DESIGN_GUAMT__d_d                 = "Designing Aluminum Beam/Column (General). (%d/%d)"
IDS_ALU_MSG_DESIGN_GUAAG__d_d                 = "Designing Aluminum Beam/Column. (%d/%d)"

IDS_ALU_TB_NAME_CHK                           = "CHK"
IDS_ALU_TB_NAME_MEMBER_NAME                   = "Member\nName"
IDS_ALU_TB_NAME_APPLY_MEMBERTO                = "Apply\nMember To"
IDS_ALU_TB_NAME_MATERIAL                      = "Material"
IDS_ALU_TB_NAME_TYPE                          = "Type"
IDS_ALU_TB_NAME_MAJOR                         = "Major"
IDS_ALU_TB_NAME_MINOR                         = "Minor"
IDS_ALU_TB_NAME_COMB                          = "Comb."
IDS_ALU_TB_NAME_CRITERIA                      = "Criteria"
IDS_ALU_TB_NAME_RATIO                         = "Ratio"
IDS_ALU_TB_NAME_PROD_TYPE                     = "Product"
IDS_ALU_TB_NAME_SPEC_DOT                      = "Sect."
IDS_ALU_TB_NAME_SECTION                       = "Section"
IDS_ALU_TB_NAME_SECT_DOT                      = "Sect."
IDS_ALU_TB_NAME_SECTION_NAME_N                = "Section\nName"
IDS_ALU_TB_NAME_PLATE                         = "Plate"
IDS_ALU_TB_NAME_PLATE_E                       = "Plate "
IDS_ALU_TB_NAME_ANCHOR_BOLT                   = "Anchor\nBolt"
IDS_ALU_TB_NAME_FCK                           = "Fck"
IDS_ALU_TB_NAME_FORCE                         = "Force"
IDS_ALU_TB_NAME_PU                            = "Pu"
IDS_ALU_TB_NAME_MUX                           = "Mux"
IDS_ALU_TB_NAME_MUY                           = "Muy"
IDS_ALU_TB_NAME_VUX                           = "Vux"
IDS_ALU_TB_NAME_VUY                           = "Vuy"
IDS_ALU_TB_NAME_SPEC                          = "SPEC"
IDS_ALU_TB_NAME_SPAN                          = "Span"
IDS_ALU_TB_NAME_LX                            = "Lx"
IDS_ALU_TB_NAME_LY                            = "Ly"
IDS_ALU_TB_NAME_KX                            = "Kx"
IDS_ALU_TB_NAME_KY                            = "Ky"
IDS_ALU_TB_NAME_LB                            = "Lb"
IDS_ALU_TB_NAME_FACTOR                        = "Factor"
IDS_ALU_TB_NAME_FACTOR_CMX                    = "Cmx"
IDS_ALU_TB_NAME_FACTOR_CMY                    = "Cmy"
IDS_ALU_TB_NAME_FACTOR_CB                     = "Cb"
IDS_ALU_TB_NAME_FACTOR_M                      = "m"
IDS_ALU_TB_NAME_DEFLECTION                    = "Deflection"
IDS_ALU_TB_NAME_DEFLECTION_BY_WIND            = "Deflection (Wind)"
IDS_ALU_TB_NAME_DEFLECTION_BY_SELF            = "Deflection (Self)"
IDS_ALU_TB_NAME_DEFLECTION_SPA                = "Deflection "
IDS_ALU_TB_NAME_DEFLECTION_CAP                = "DEFLECTION"
IDS_ALU_TB_NAME_STRESS                        = "Stress"
IDS_ALU_TB_NAME_STRESS_SPACE                  = "Stress "
IDS_ALU_TB_NAME_BENDING                       = "Bending"
IDS_ALU_TB_NAME_BENDING_MAJOR                 = "Bending(Major)"
IDS_ALU_TB_NAME_BENDING_MINOR                 = "Bending(Minor)"
IDS_ALU_TB_NAME_SHEAR                         = "Shear"
IDS_ALU_TB_NAME_SHEAR_MAJOR                   = "Shear(Major)"
IDS_ALU_TB_NAME_SHEAR_MINOR                   = "Shear(Minor)"
IDS_ALU_TB_NAME_AXIAL                         = "Axial"
IDS_ALU_TB_NAME_AXIAL_N_BENDING               = "Axial +\nBending"
IDS_ALU_TB_NAME_DELTA                         = "δ"
IDS_ALU_TB_NAME_DELTA_BY_WIND                 = "Wind"
IDS_ALU_TB_NAME_DELTA_BY_SELF                 = "Self"
IDS_ALU_TB_NAME_DELTA_BY_WIND_BLANK           = "Wind "
IDS_ALU_TB_NAME_DELTA_BY_SELF_BLANK           = "Self "
IDS_ALU_TB_NAME_DELTA_ALLOW                   = "δallow"
IDS_ALU_TB_NAME_SPAN_UNDR_4110MM              = "L ≤ 13.5ft"
IDS_ALU_TB_NAME_SPAN_OVER_4110MM              = "L > 13.5ft"
IDS_ALU_TB_NAME_DEFL_SPAN                     = "Span"
IDS_ALU_TB_NAME_DEFL_VALUE                    = "Value"
IDS_ALU_TB_NAME_DESIGN_STRESS                 = "Design Stress"
IDS_ALU_TB_NAME_DESIGN_RATIO                  = "Design Ratio"
IDS_ALU_TB_NAME_COMBINED_RATIO                = "Combined Ratio"
IDS_ALU_TB_NAME_LCOMB                         = "Load Comb."
IDS_ALU_TB_NAME_LCOMBINATION                  = "Load Combination"
IDS_ALU_TB_NAME_DOTDOTDOT                     = "..."
IDS_ALU_TB_NAME_SELF                          = "Self"

IDS_ALU_TB_NAME_STRESS_MAJOR                  = "STRESS ( MAJOR )"
IDS_ALU_TB_NAME_STRESS_MINOR                  = "STRESS ( MINOR )"
IDS_ALU_TB_NAME_RATIO_MAJOR                   = "RATIO ( MAJOR )"
IDS_ALU_TB_NAME_RATIO_MINOR                   = "RATIO ( MINOR )"
IDS_ALU_TB_NAME_RATIO_COMBINED                = "COMBINED"
IDS_ALU_TB_NAME_RATIO_COMBINED_RATIO_CAP      = "COMBINED RATIO"
IDS_ALU_TB_NAME_SPEC_NAME                     = "SPEC"
IDS_ALU_TB_NAME_SPEC_SPEC14                   = "SPEC #14"
IDS_ALU_TB_NAME_SPEC_SPEC15                   = "SPEC #15"
IDS_ALU_TB_NAME_SPEC_SPEC16                   = "SPEC #16"
IDS_ALU_TB_NAME_SPEC_SPEC17                   = "SPEC #17"
IDS_ALU_TB_NAME_SPEC_SPEC18                   = "SPEC #18"
IDS_ALU_TB_NAME_SPEC_SPEC20                   = "SPEC #20"
IDS_ALU_TB_NAME_SPEC_SPEC21                   = "SPEC #21"
IDS_ALU_TB_NAME_SPEC_S                        = "S"
IDS_ALU_TB_NAME_SPEC_S1                       = "S1"
IDS_ALU_TB_NAME_SPEC_S2                       = "S2"
IDS_ALU_TB_NAME_SPEC_FbFs                     = "Fb,Fs"
IDS_ALU_TB_NAME_SPEC_fb                       = "fb"
IDS_ALU_TB_NAME_SPEC_FB                       = "Fb"
IDS_ALU_TB_NAME_SPEC_fs                       = "fs"
IDS_ALU_TB_NAME_SPEC_FS                       = "Fs"
IDS_ALU_TB_NAME_SPEC_F_CAP                    = "F"
IDS_ALU_TB_NAME_SPEC_F_MIN                    = "f"
IDS_ALU_TB_NAME_SPEC_F_MIN_CAP                = "f / F"
IDS_ALU_TB_NAME_STRS_CAP_TENS                 = "TENSILE STRESS"
IDS_ALU_TB_NAME_STRS_CAP_COMP                 = "COMPRESSIVE STRESS"
IDS_ALU_TB_NAME_STRS_CAP_MOMA                 = "BENDING STRESS ( MAJOR AXIS )"
IDS_ALU_TB_NAME_STRS_CAP_MOMI                 = "BENDING STRESS ( MINOR AXIS )"
IDS_ALU_TB_NAME_STRS_CAP_SHMA                 = "SHEAR STRESS ( MAJOR AXIS )"
IDS_ALU_TB_NAME_STRS_CAP_SHMI                 = "SHEAR STRESS ( MINOR AXIS )"
IDS_ALU_TB_NAME_STRS_CAP_RATO                 = "STRESS RATIO"
IDS_ALU_TB_NAME_STRS_RATO                     = "Stress Ratio"
IDS_ALU_TB_NAME_STRS_RATO_COMB                = "Combined Ratio"
IDS_ALU_TB_NAME_STRS_CAP_COMB_AB              = "COMBINED RATIO ( AXIAL + BENDING )"
IDS_ALU_TB_NAME_STRS_CAP_COMB_ABS             = "COMBINED RATIO ( AXIAL + BENDING + SHEAR )"
IDS_ALU_TB_NAME_STRS_COMB                     = "Combined"
IDS_ALU_TB_NAME_CAP_R                         = "R"
IDS_ALU_TB_NAME_CAP_R1                        = "R1"
IDS_ALU_TB_NAME_CAP_R2                        = "R2"
IDS_ALU_TB_NAME_ALLOWABLE_STRESS              = "Allowable Stress"
IDS_ALU_TB_NAME_STRS_FA                       = "Fa"
IDS_ALU_TB_NAME_STRS_FBX                      = "Fbx"
IDS_ALU_TB_NAME_STRS_FBY                      = "Fby"
IDS_ALU_TB_NAME_STRS_FSX                      = "Fsx"
IDS_ALU_TB_NAME_STRS_FSY                      = "Fsy"

IDS_ALU_TB_NAME_T                             = "t"
IDS_ALU_TB_NAME_B_OR_RB                       = "b, Rb"
IDS_ALU_TB_NAME_H_OR_AE                       = "h, ae"
IDS_ALU_TB_NAME_TENS_TENS                     = "TENSION"
IDS_ALU_TB_NAME_TENS_BEAM                     = "TENSION IN BEAMS"
IDS_ALU_TB_NAME_COMP_COLS                     = "COMPRESSION IN COLUMNS"
IDS_ALU_TB_NAME_COMP_COL_ELEM                 = "COMPRESSION IN COLUMN ELEMENTS"
IDS_ALU_TB_NAME_COMP_BEAM                     = "COMPRESSION IN BEAMS"
IDS_ALU_TB_NAME_COMP_BEAM_ELEM                = "COMPRESSION IN BEAM ELEMENTS"
IDS_ALU_TB_NAME_SHEAR_ELEM                    = "SHEAR IN ELEMENTS"

IDS_ALU_TOOLTIP_FORCE_PX                      = "Axial Force\n(+) : Compression \n(-) : Tension"
IDS_ALU_TOOLTIP_FORCE_MX                      = "Bending Moment ( Strong Axis )"
IDS_ALU_TOOLTIP_FORCE_MY                      = "Bending Moment ( Weak Axis )"
IDS_ALU_TOOLTIP_FORCE_VX                      = "Shear Force ( Weak Axis )"
IDS_ALU_TOOLTIP_FORCE_VY                      = "Shear Force ( Strong Axis )"
IDS_ALU_TOOLTIP_LENGTH_LX                     = "Span"
IDS_ALU_TOOLTIP_LENGTH_LY                     = "Span"
IDS_ALU_TOOLTIP_LENGTH_KX                     = "Effective Length Coefficient for Buckling"
IDS_ALU_TOOLTIP_LENGTH_KY                     = "Effective Length Coefficient for Buckling"
IDS_ALU_TOOLTIP_LENGTH_LB                     = "Unbraced Length"
IDS_ALU_TOOLTIP_FACTOR_CM                     = "Factor for Calculation of Combined Stress Ratio \nCm = 0.6 - 0.4(M1/M2)"
IDS_ALU_TOOLTIP_FACTOR_CB                     = "Lateral Buckling Coefficient"
IDS_ALU_TOOLTIP_FACTOR_M                      = "m = 1.15 + Co/2Cc [ -1 < Co/Cc < 1 ] \nm = 1.3 / (1 - Co/Cc) [ Co/Cc <= -1 ]"
IDS_ALU_TOOLTIP_DELTA_WIND                    = "Deflection by Wind Load"
IDS_ALU_TOOLTIP_DELTA_SELF                    = "Deflection by Self Weight"
